#+BEGIN_EXAMPLE
37 36  35  34  33  32  31
38 17  16  15  14  13  30
39 18   5   4   3  12  29
40 19   6   1   2  11  28
41 20   7   8   9  10  27
42 21  22  23  24  25  26
43 44  45  46  47  48  49
#+END_EXAMPLE

Rechter-onderhoek -> oneven kwadraat

Input: 312051

Eerstvolgende oneven kwadraat:
#+BEGIN_SRC elisp :exports results
(ceiling (sqrt 312051))
#+END_SRC

#+RESULTS:
: 559

#+BEGIN_SRC elisp
(* 559 559)
#+END_SRC

#+RESULTS:
: 312481

#+BEGIN_SRC elisp
(- 312481 312051)
#+END_SRC

#+RESULTS:
: 430

Zijden zijn 559 lang, verschil tot de rechteronderhoek is 430, dus we zitten op de zuid-rand

zuid-rand loopt van 559^2 tot (559^2 - 558)
#+BEGIN_SRC elisp
(- (* 559 559) 558)
#+END_SRC

#+RESULTS:
: 311923

Punt in het midden van de zuidrand ligt dan op
#+BEGIN_SRC elisp
(/ (- 559 1) 2)
#+END_SRC

#+RESULTS:
: 279

Afstand van 430 tot 279
#+BEGIN_SRC elisp
(- 430 279)
#+END_SRC

#+RESULTS:
: 151

Totale afstand => 151 + (559 - 1) / 2 => 430
